{
  "ping_sweep": "Ping Sweep is a technique used to discover active hosts within a specified range of IP addresses. In this method ARP(Address Resolution Protocol) messages were used to find out active hosts. ",
  "port_scan": "Port Scanning allows you to find which ports are open or closed in a network. In networking, a port serves as a communication endpoint for different types of traffic. Think of it as doors or entry points on a building. A port scan essentially checks these 'doors' to see if they're open or closed. By specifying a target IP address or a domain name, and a range of ports to scan (from a starting port to an ending port), you can see which ports are open. It's like checking which doors are locked or open in a house, helping you understand about vulnerabilities.",
  "ping_command": "Ping command allows users to test network connectivity and latency to a specific host. When you ping a device, your computer sends out a small packet of data to the target IP address. The target device then responds, allowing you to measure the round-trip time and determine if the device is reachable.",
  "traceroute_command": "Traceroute is a command-line utility that helps users trace the path taken by packets from their computer to a specified destination host. It works by sending a series of network packets with incrementally increasing Time-To-Live (TTL) values. As each packet moves through routers and network devices, they decrement the TTL value. When the TTL reaches zero, the device discards the packet and sends back an ICMP Time Exceeded message to the sender. By analyzing the series of ICMP Time Exceeded messages received, traceroute reconstructs the path taken by the packets, providing valuable insights into the network topology and helping diagnose connectivity issues.",
  "mac_address_lookup": "MAC Address Lookup is a service that enables users to discover the manufacturer or vendor associated with a specific MAC address. A MAC address, also known as a Media Access Control address, is a unique identifier assigned to network interfaces for communications on a device. This is done by querying a database of registered MAC address prefixes."
}
